In [18]:
import pandas as pd
import numpy as np

In [19]:
data=pd.read_csv(r"C:\Users\KIIT\Desktop\DIVINE AI\titanic_train.csv")

In [20]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [22]:
data=data.drop(["Name","Sex","Ticket","Cabin","Embarked"],axis =1) ## [] brackest are requires ,bcoz drop taeks 1 argument only
data

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [23]:
data["Age"].fillna(data["Age"].mean(),inplace=True)  ## to take mean at of a colunn and fill it an nan positions

In [24]:
data

     PassengerId  Survived  Pclass        Age  SibSp  Parch     Fare
0              1         0       3  22.000000      1      0   7.2500
1              2         1       1  38.000000      1      0  71.2833
2              3         1       3  26.000000      0      0   7.9250
3              4         1       1  35.000000      1      0  53.1000
4              5         0       3  35.000000      0      0   8.0500
..           ...       ...     ...        ...    ...    ...      ...
886          887         0       2  27.000000      0      0  13.0000
887          888         1       1  19.000000      0      0  30.0000
888          889         0       3  29.699118      1      2  23.4500
889          890         1       1  26.000000      0      0  30.0000
890          891         0       3  32.000000      0      0   7.7500

[891 rows x 7 columns]

In [25]:
data.info()  ## checking if nullvalues present

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

spitting  the data in x and y

In [26]:
x=data.drop("Survived",axis =1)

In [27]:
x.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0            1       3  22.0      1      0   7.2500
1            2       1  38.0      1      0  71.2833
2            3       3  26.0      0      0   7.9250
3            4       1  35.0      1      0  53.1000
4            5       3  35.0      0      0   8.0500

In [28]:
x.shape

(891, 6)

In [29]:
y=data.loc[:,"Survived"]

In [30]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [31]:
y.shape

(891,)

splitting the data in train and test manually 
this can directly be used to dothe prediction and accuracy becozwe are splitting the data manually here using the loc and iloc functions

In [32]:
x_train=x.loc[0:799]
x_test=x.loc[800:]

In [33]:
y_train=y.loc[0:799]
y_test=y.loc[800:]

In [34]:
x_train.shape

(800, 6)

In [35]:
x_test.shape

(91, 6)

In [36]:
x_train.shape

(800, 6)

In [37]:
y_test.shape

(91,)

now doing the train test splitting using sklearn.modelselection train_test_split

here we can directly split the data in x_test ,x_train ....... and can use them further

In [38]:
from sklearn.model_selection import train_test_split

In [39]:
## test size if not used the data is randomly splitted ,here splitted randomly
x_train , x_test ,y_train ,y_test =train_test_split(x,y)

In [40]:
display(x_train.shape)
display(x_test.shape) 
display(y_train.shape)
display(y_test.shape)

(668, 6)

(223, 6)

(668,)

(223,)

here splitteed with the test size 20 percent

In [42]:
## test size if not used the data is randomly splitted 
x_train , x_test ,y_train ,y_test =train_test_split(x,y,test_size=.20)

In [43]:
display(x_train.shape)
display(x_test.shape) 
display(y_train.shape)
display(y_test.shape)

(712, 6)

(179, 6)

(712,)

(179,)